import { Text } from "@gravity-ui/uikit";
import { Breadcrumbs } from "../../widgets/Breadcrumbs/Breadcrumbs";
import styles from './SubCatalog.module.css';
import { AsideHeader } from "./AsideHeader";
import { ProductGrid } from "./ProductGrid";

export function SubCatalog() {
    const categories = [
        {
            id: 0,
            title: "Классное оборудование",
            products: [
                {
                    id: 1,
                    title: "Комплект инструментов классных КИК",
                    rating: 4.2,
                    img: "/set.jpg"
                },
                {
                    id: 2,
                    title: "Линейка 25 см. четырехугольная",
                    rating: 4.0,
                    img: "/line25.jpg"
                },
                {
                    id: 3,
                    title: "Линейка пластмассовая с ручкой 1 м",
                    rating: 3.8,
                    img: "/lineHand.jpg"
                },
                {
                    id: 4,
                    title: "Метр демонстрационный",
                    rating: 4.5,
                    img: "/line1demo.jpg"
                },
                {
                    id: 5,
                    title: "Наборное полотно (600×500)",
                    rating: 4.1,
                    img: "/TypesettingCanvas600.jpg"
                },
                {
                    id: 6,
                    title: "Наборное полотно (800×500)",
                    rating: 4.3,
                    img: "/TypesettingCanvas800.jpg"
                },
                {
                    id: 7,
                    title: "Транспортир пластмассовый с ручкой",
                    rating: 3.9,
                    img: "/Protractor.jpg"
                },
                {
                    id: 8,
                    title: "Угольник пластмассовый 30-60",
                    rating: 4.0,
                    img: "/Square30.jpg"
                },
                {
                    id: 9,
                    title: "Угольник пластмассовый 45-45",
                    rating: 4.1,
                    img: "/Square45.jpg"
                },
                {
                    id: 10,
                    title: "Указка",
                    rating: 3.7,
                    img: "/pointer.jpg"
                },
                {
                    id: 11,
                    title: "Циркуль пластмассовый",
                    rating: 4.2,
                    img: "/dividers.jpg"
                }
            ]
        },
        {
            id: 1,
            title: "Портреты",
            products: [
                {
                    id: 12,
                    title: "Портреты математиков (А3 цветные 12шт.)",
                    rating: 4.6,
                    img: ""
                }
            ]
        },
        {
            id: 2,
            title: "Пособия общего назначения",
            products: [
                {
                    id: 13,
                    title: "Математическая пирамида Вычитание до 1000",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 14,
                    title: "Математическая пирамида Вычитание до 1000 (демонстрационная)",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 15,
                    title: "Математическая пирамида Деление",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 16,
                    title: "Математическая пирамида Доли раздаточная",
                    rating: 4.1,
                    img: ""
                },
                {
                    id: 17,
                    title: "Математическая пирамида Дроби",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 18,
                    title: "Математическая пирамида Сложение до 1000",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 19,
                    title: "Математическая пирамида Сложение до 1000 (демонстрационная)",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 20,
                    title: "Математическая пирамида Умножение",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 21,
                    title: "Модель «Единицы объема»",
                    rating: 4.0,
                    img: ""
                },
                {
                    id: 22,
                    title: "Набор геометрических тел демонстрационный",
                    rating: 4.6,
                    img: ""
                },
                {
                    id: 23,
                    title: "Набор для конструирования геометрических тел в плоскости",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 24,
                    title: "Набор прозрачных геометрических тел разборный (12 предметов) малый",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 25,
                    title: "Набор прозрачных геометрических тел с разверткой (8 фигур)",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 26,
                    title: "Набор прозрачных геометрических тел с сечением (разборный большой)",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 27,
                    title: "Набор цифр, букв и знаков с магнитным креплением по математике для средней школы",
                    rating: 4.7,
                    img: ""
                }
            ]
        },
        {
            id: 3,
            title: "Таблицы",
            products: [
                {
                    id: 28,
                    title: "Комплект таблиц «Алгебра. 7 класс» (15 таблиц)",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 29,
                    title: "Комплект таблиц «Алгебра. 7-11 класс» (16 таблиц)",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 30,
                    title: "Комплект таблиц «Алгебра. 8 класс» (14 таблиц)",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 31,
                    title: "Комплект таблиц «Алгебра. 9 класс» (12 таблиц)",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 32,
                    title: "Комплект таблиц «Векторы» (6 таблиц)",
                    rating: 4.1,
                    img: ""
                },
                {
                    id: 33,
                    title: "Комплект таблиц «Геометрия. 11 класс» (12 таблиц)",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 34,
                    title: "Комплект таблиц «Геометрия. 7-11 класс» (10 таблиц)",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 35,
                    title: "Комплект таблиц «Комбинаторика» (5 таблиц)",
                    rating: 4.0,
                    img: ""
                },
                {
                    id: 36,
                    title: "Комплект таблиц «Математические таблицы для оформления кабинета» (9 таблиц)",
                    rating: 4.6,
                    img: ""
                },
                {
                    id: 37,
                    title: "Комплект таблиц «Многогранники. Тела вращения» (11 таблиц + 64 карточки)",
                    rating: 4.7,
                    img: ""
                },
                {
                    id: 38,
                    title: "Комплект таблиц «Многоугольники» (7 таблиц)",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 39,
                    title: "Комплект таблиц «Неравенства. Решение неравенств» (13 таблиц)",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 40,
                    title: "Комплект таблиц «Производная и ее применение» (12 таблиц + 48 карточек)",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 41,
                    title: "Комплект таблиц «Стереометрия» (9 таблиц)",
                    rating: 4.1,
                    img: ""
                },
                {
                    id: 42,
                    title: "Комплект таблиц «Теория вероятностей и математическая статистика» (6 таблиц)",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 43,
                    title: "Комплект таблиц «Треугольники» (14 таблиц)",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 44,
                    title: "Комплект таблиц «Тригонометрические уравнения и неравенства» (7 таблиц)",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 45,
                    title: "Комплект таблиц «Тригонометрические функции» (8 таблиц)",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 46,
                    title: "Комплект таблиц «Уравнения. Графическое решение уравнений» (12 таблиц)",
                    rating: 4.1,
                    img: ""
                },
                {
                    id: 47,
                    title: "Комплект таблиц «Функции и графики» (10 таблиц)",
                    rating: 4.6,
                    img: ""
                },
                {
                    id: 48,
                    title: "Комплект таблиц «Алгебра и начала анализа 10 кл.» (17 шт.)",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 49,
                    title: "Комплект таблиц «Алгебра и начала анализа 11 кл.» (15 шт.)",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 50,
                    title: "Комплект таблиц «Математика 5 кл.» (18 шт.)",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 51,
                    title: "Комплект таблиц «Математика 6 кл.» (12 шт.)",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 52,
                    title: "Комплект таблиц «Многогранники. Тела вращения» (11 шт.+ CD)",
                    rating: 4.7,
                    img: ""
                },
                {
                    id: 53,
                    title: "Комплект таблиц «Производная и ее применение» (12 шт.+ CD)",
                    rating: 4.6,
                    img: ""
                },
                {
                    id: 54,
                    title: "Комплект таблиц «Геометрия. 10 класс» (14 таблиц)",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 55,
                    title: "Комплект таблиц «Геометрия. 7 класс» (14 таблиц)",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 56,
                    title: "Комплект таблиц «Геометрия. 8 класс» (15 таблиц)",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 57,
                    title: "Комплект таблиц «Геометрия. 9 класс» (13 таблиц)",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 58,
                    title: "Комплект таблиц по алгебре 9-11 кл. (6 шт.) ч. 3",
                    rating: 4.1,
                    img: ""
                },
                {
                    id: 59,
                    title: "Комплект таблиц по алгебре и началам анализа 10-11 кл. (25 шт.) ч. 6",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 60,
                    title: "Комплект таблиц по геометрии 9-11 кл. (4 шт.) ч. 4",
                    rating: 4.0,
                    img: ""
                },
                {
                    id: 61,
                    title: "Комплект таблиц по математике для средней школы 5-11 кл. ч. 2 (29 шт.)",
                    rating: 4.7,
                    img: ""
                },
                {
                    id: 62,
                    title: "Магниты круглые 3 см.",
                    rating: 3.8,
                    img: ""
                },
                {
                    id: 63,
                    title: "Набор магнитов круглых (4 шт.)",
                    rating: 4.0,
                    img: ""
                },
                {
                    id: 64,
                    title: "Таблица «Приставка для образования десятичных кратных и дольных единиц»",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 65,
                    title: "Таблица Геометрические фигуры и тела 70х100 винил",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 66,
                    title: "Таблица Параллелограмм. Трапеция 70х100 винил",
                    rating: 4.1,
                    img: ""
                },
                {
                    id: 67,
                    title: "Таблица Планиметрия (Векторы на плоскости) 70х100 винил",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 68,
                    title: "Таблица Прямоугольный треугольник 70х100 винил",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 69,
                    title: "Таблица Стереометрия (Векторы в пространстве) 70х100 винил",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 70,
                    title: "Таблица Тригонометрия 70х100 винил",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 71,
                    title: "Таблицы Информатика и ИКТ 5-7 класс (17 шт.)",
                    rating: 4.6,
                    img: ""
                },
                {
                    id: 72,
                    title: "Таблицы Информатика и ИКТ 8-9 класс (7-9 кл.) (11 шт.)",
                    rating: 4.4,
                    img: ""
                }
            ]
        },
        {
            id: 4,
            title: "Таблицы раздаточные (А4)",
            products: [
                {
                    id: 73,
                    title: "Алгебра — Часть 1",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 74,
                    title: "Алгебра — Часть 2",
                    rating: 4.1,
                    img: ""
                },
                {
                    id: 75,
                    title: "Алгебра — Часть 3",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 76,
                    title: "Алгебра — Часть 4",
                    rating: 4.0,
                    img: ""
                },
                {
                    id: 77,
                    title: "Высшая математика — Часть 1",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 78,
                    title: "Высшая математика — Часть 2",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 79,
                    title: "Высшая математика — Часть 3",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 80,
                    title: "Высшая математика — Часть 4",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 81,
                    title: "Высшая математика — Часть 5",
                    rating: 4.4,
                    img: ""
                },
                {
                    id: 82,
                    title: "Высшая математика — Часть 6",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 83,
                    title: "Высшая математика — Часть 7",
                    rating: 4.5,
                    img: ""
                },
                {
                    id: 84,
                    title: "Геометрия — Часть 1",
                    rating: 4.2,
                    img: ""
                },
                {
                    id: 85,
                    title: "Геометрия — Часть 2",
                    rating: 4.1,
                    img: ""
                },
                {
                    id: 86,
                    title: "Геометрия — Часть 3",
                    rating: 4.3,
                    img: ""
                },
                {
                    id: 87,
                    title: "Геометрия — Часть 4",
                    rating: 4.0,
                    img: ""
                },
                {
                    id: 88,
                    title: "Статистика",
                    rating: 4.6,
                    img: ""
                }
            ]
        },
        {
            id: 5,
            title: "Технические средства обучения",
            products: [
                {
                    id: 89,
                    title: "Рамка-стенд 700х1000 мм.",
                    rating: 4.6,
                    img: ""
                }
            ]
        },
        {
            id: 6,
            title: "Транспаранты",
            products: [
                {
                    id: 90,
                    title: "Измерение геометрических величин",
                    rating: 4.6,
                    img: ""
                },
                {
                    id: 91,
                    title: "Комплект транспарантов «Алгебра. Функции»",
                    rating: 5,
                    img: ""
                },
                {
                    id: 92,
                    title: "Комплект транспарантов «Геометрические фигуры»",
                    rating: 2.9,
                    img: ""
                },
                {
                    id: 93,
                    title: "Комплект транспарантов «Геометрия. Планиметрия»",
                    rating: 4.6,
                    img: ""
                },
                {
                    id: 94,
                    title: "Комплект транспарантов «Построение графиков функций»",
                    rating: 5,
                    img: ""
                },
                {
                    id: 96,
                    title: "Комплект транспарантов «Функции. Их свойства и графики»",
                    rating: 3.6,
                    img: ""
                },
                {
                    id: 97,
                    title: "Математика (средняя школа) (154 пленки)",
                    rating: 3.6,
                    img: ""
                }
            ]
        },
        {
            id: 7,
            title: "Электронные наглядные пособия (DVD - диск)",
            products: [
                {
                    id: 98,
                    title: "DVD Первая наука человечества. Математика (История математики)",
                    rating: 5.0,
                    img: ""
                },
                {
                    id: 99,
                    title: "DVD Стереометрия ч. 1 (10 класс)",
                    rating: 4.0,
                    img: ""
                },
                {
                    id: 100,
                    title: "DVD Стереометрия ч. 2 (11 класс)",
                    rating: 3.7,
                    img: ""
                },
            ]
        },
    ];

    return (
        <div className={styles.container}>
            <header className={styles.header}>
                <Text as="h1" variant="display-3" className={styles.title}>
                    Математика
                </Text>
                <Breadcrumbs />
            </header>
            <div className={styles.wrapper}>
                <div>
                    <AsideHeader />
                </div>
                <div className={styles.productsGrid}>
                    {categories.map(cat => (<ProductGrid key={cat.id} title={cat.title} products={cat.products} />))}
                </div>
            </div>
        </div>
    );
}